app/controllers/admins_controller.rb

  def effect_list
    @effects = Effect.all.order("created_at DESC")
---
SELECT "effects".* FROM "effects"   ORDER BY created_at DESC

  def install_list
    @installs = Install.all.order("created_at DESC")
---
SELECT "installs".* FROM "installs"   ORDER BY created_at DESC

  def special_list
    @specials = Special.all.order("created_at DESC")
---
SELECT "specials".* FROM "specials"   ORDER BY created_at DESC

  def item_list
    @classifications = Classification.all

    @items = Item.order('created_at DESC').all
---
SELECT "classifications".* FROM "classifications"
SELECT "items".* FROM "items"   ORDER BY created_at DESC

  def gallery_list
    @galleries = Gallery.all.order("created_at DESC")
---
SELECT "galleries".* FROM "galleries"   ORDER BY created_at DESC