app/controllers/classifications_controller.rb

  def index
    @classifications = Classification.all
---
SELECT "classifications".* FROM "classifications"

  def edit
    @classification = Classification.find(params[:id])
---
SELECT  "classifications".* FROM "classifications"  WHERE "classifications"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @classification = Classification.new(classification_params)

    respond_to do |format|
      if @classification.save
---
INSERT INTO "classifications" ("created_at", "title", "updated_at") VALUES (?, ?, ?)  [["created_at", "2015-04-19 08:46:55.833845"], ["title", "aas"], ["updated_at", "2015-04-19 08:46:55.833845"]]