app/controllers/effects_controller.rb

  def index
    #@company = Company.find(1)
    @effects = Effect.page(params[:page]).per(1)
---
SELECT COUNT(*) FROM "effects"

  def create
    @effect = Effect.new(effect_params)

    respond_to do |format|
      if @effect.save
---
INSERT INTO "effects" ("created_at", "image2_content_type", "image2_file_name", "image2_file_size", "image2_updated_at", "image3_content_type", "image3_file_name", "image3_file_size", "image3_updated_at", "image4_content_type", "image4_file_name", "image4_file_size", "image4_updated_at", "image5_content_type", "image5_file_name", "image5_file_size", "image5_updated_at", "image6_content_type", "image6_file_name", "image6_file_size", "image6_updated_at", "image7_content_type", "image7_file_name", "image7_file_size", "image7_updated_at", "image8_content_type", "image8_file_name", "image8_file_size", "image8_updated_at", "image9_content_type", "image9_file_name", "image9_file_size", "image9_updated_at", "image_content_type", "image_file_name", "image_file_size", "image_updated_at", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def destroy
    @effect.destroy
---
DELETE FROM "effects" WHERE "effects"."id" = ?  [["id", 2]]

    def set_effect
      @effect = Effect.find(params[:id])
---
SELECT  "effects".* FROM "effects"  WHERE "effects"."id" = ? LIMIT 1  [["id", 2]]