app/controllers/galleries_controller.rb

  def index
    @galleries = Gallery.page(params[:page]).per(4)
---
SELECT "galleries".* FROM "galleries"
SELECT COUNT(*) FROM "galleries"

  def show
    @gallery  = Gallery.find(params[:id])
    @pictures = @gallery.pictures.page(params[:page]).per(6)
---
SELECT  "galleries".* FROM "galleries"  WHERE "galleries"."id" = ? LIMIT 1  [["id", 1]]
SELECT "pictures".* FROM "pictures"  WHERE "pictures"."gallery_id" = ?  [["gallery_id", 1]]
SELECT COUNT(*) FROM "pictures"  WHERE "pictures"."gallery_id" = ?  [["gallery_id", 2]]

  def create
    @gallery = Gallery.new(gallery_params)

    respond_to do |format|
      if @gallery.save

        if params[:images]
          # The magic is here ;)
          params[:images].each { |image|
            @gallery.pictures.create(image: image)
---
INSERT INTO "galleries" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", "2015-05-28 09:06:26.625734"], ["name", "asdf"], ["updated_at", "2015-05-28 09:06:26.625734"]]
INSERT INTO "pictures" ("created_at", "gallery_id", "image_content_type", "image_file_name", "image_file_size", "image_updated_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def destroy
    @gallery = Gallery.find(params[:id])
    @gallery.destroy
---
SELECT  "galleries".* FROM "galleries"  WHERE "galleries"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "galleries" WHERE "galleries"."id" = ?  [["id", 2]]