app/controllers/pictures_controller.rb

SELECT  "pictures".* FROM "pictures"  WHERE "pictures"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    #@gallery = Gallery.find(params[:gallery_id])

    @picture = Picture.find(params[:id])