app/views/galleries/index.html.erb

         <div class="col-md-3 effect-item">
            <% if gallery.pictures.first %>
---
SELECT  "pictures".* FROM "pictures"  WHERE "pictures"."gallery_id" = ?  ORDER BY "pictures"."id" ASC LIMIT 1  [["gallery_id", 1]]